# -*- coding:utf-8; -*-
#+TITLE: Unit Tests & Examples for Orgtbl Aggregate
Copyright (C) 2013-2014  Thierry Banel

org-aggregate is free software: you can redistribute it and/or modify
it under the terms of the GNU General Public License as published by
the Free Software Foundation, either version 3 of the License, or
(at your option) any later version.

org-aggregate is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
GNU General Public License for more details.

You should have received a copy of the GNU General Public License
along with this program.  If not, see <http://www.gnu.org/licenses/>.


Running all the tests should not change anything to this page.

All pull-mode tests can be re-computed at once by executing:
(org-update-all-dblocks)

All push-mode tests can be re-computed at once by executing:
(org-table-map-tables
  (lambda ()
    (org-table-align)
    (orgtbl-send-table 'maybe)))

** Resulting tables
Type C-c C-c within each to refresh

Note the :formula parameter to add a new column after the aggregation has been computed

#+BEGIN: aggregate :table pulledtable :cols ("qû" "mean(zö)") :formula "$3=$2*100"
| qû |      mean(zö) |           |
|----+---------------+-----------|
| b  | 6.33333333333 | 633.33333 |
| a  | 4.14285714286 | 414.28571 |
#+TBLFM: $3=$2*100
#+END

Note the additional $8 column automatically computed after the aggregation

#+BEGIN: aggregate :table pulledtable :cols "sum(xà) qû sum(yÿ) mean(zö) sum(xà*xà) min(zö) max(zö)"
| sum(xà)    | qû | sum(yÿ)      |      mean(zö) | sum(xà*xà)        | min(zö) | max(zö) |     |
|------------+----+--------------+---------------+-------------------+---------+---------+-----|
| 2 b + 45   | b  | b^2 + b + 32 | 6.33333333333 | 6 b + 2 b^2 + 459 |       1 |       9 |   5 |
| 2 a + 19.1 | a  | 11 a + 12    | 4.14285714286 | 2 a^2 + 78.01     |       1 |       8 | 4.5 |
#+TBLFM: $8=($6+$7)/2
#+END

#+BEGIN: aggregate :table pulledtable :cols "pé count() sum($4) mean(zö) sum(zö*zö) list(xà) min(yÿ) max(yÿ)"
| pé | count() |    sum($4) | mean(zö) | sum(zö*zö) | list(xà)           |        min(yÿ) |        max(yÿ) |
|----+---------+------------+----------+------------+--------------------+----------------+----------------|
|  1 |       3 |         12 |        7 |        161 | ("5.1" "3" "12")   |              2 |              8 |
|  3 |       4 |         22 |     3.25 |         87 | ("9" "5" "3" "12") |              2 |              8 |
|  2 |       2 |         10 |      3.5 |         29 | ("9" "3")          |              2 |              8 |
|  4 |       2 |      b + a |        7 |        100 | ("b" "a")          |      min(b, a) |      max(b, a) |
|  5 |       2 | b^2 + 10 a |        6 |         80 | ("b+3" "a")        | min(b^2, 10 a) | max(b^2, 10 a) |
#+END

#+BEGIN: aggregate :table pulledtable :cols "count() mean(xà) mean(yÿ) mean(zö)"
| count() | mean(xà)                                  | mean(yÿ)                                             |      mean(zö) |
|---------+-------------------------------------------+------------------------------------------------------+---------------|
|      13 | 2:13 b + 0.153846153846 a + 4.93076923077 | b^2 / 13 + b / 13 + 0.846153846154 a + 3.38461538462 | 5.15384615385 |
#+END

#+BEGIN: aggregate :table pulledtable :cols "pé count() mean(zö) meane(zö) gmean(zö) hmean(zö) median(zö)"
| pé | count() | mean(zö) | meane(zö)              |     gmean(zö) |     hmean(zö) | median(zö) |
|----+---------+----------+------------------------+---------------+---------------+------------|
|  1 |       3 |        7 | 7 +/- 1.52752523165    | 6.60385449779 | 6.17142857143 |          8 |
|  3 |       4 |     3.25 | 3.25 +/- 1.93110503771 | 2.05976714391 | 1.53191489362 |        1.5 |
|  2 |       2 |      3.5 | 3.5 +/- 1.5            | 3.16227766017 | 2.85714285714 |        3.5 |
|  4 |       2 |        7 | 7 +/- 1                | 6.92820323028 | 6.85714285714 |          7 |
|  5 |       2 |        6 | 6 +/- 2                | 5.65685424949 | 5.33333333333 |          6 |
#+END

#+BEGIN: aggregate :table pulledtable :cols "qû count() prod(zö) sdev(zö) pvar(zö) psdev(zö)"
| qû | count() | prod(zö) |      sdev(zö) |      pvar(zö) |     psdev(zö) |
|----+---------+----------+---------------+---------------+---------------|
| b  |       6 |    19440 | 3.07679486912 | 7.88888888889 | 2.80871659106 |
| a  |       7 |     4096 | 2.85356919364 | 6.97959183673 | 2.64189171556 |
#+END

#+BEGIN: aggregate :table pulledtable :cols "qû count() cov(zö,xà) pcov(zö,zö) corr(zö,zö)"
| qû | count() | cov(zö,xà)                       |   pcov(zö,zö) | corr(zö,zö) |
|----+---------+----------------------------------+---------------+-------------|
| b  |       6 | 0.266666666666 b + 1.79999999996 | 7.88888888889 |          1. |
| a  |       7 | 0.619047619048 a - 1.22142857143 | 6.97959183673 |          1. |
#+END

